<?php
/*
米欧光影工作室
最全面最专业的微信公众平台开发教程

http://www.cnblogs.com/txw1958/p/weixin-php-sdk.html
微信公众平台开发接口PHP SDK完整版

官方提供的SDK只有一个文本消息功能，我们将所有消息的消息类型及事件响应都整理了进来，并且加入日志记录，代码如下：


更新日志：

2013-01-01 版本1.0，包含Token验证及基本消息接口的收发
2014-03-15 增加图片、视频、语音的内容回复
2014-04-09 增加菜单链接事件
2014-04-10 修改文本回复的判定方法
2014-05-20 增加高级群发消息通知事件
2014-05-26 增加多客服消息及多客服的判定方法
2014-05-27 修改自动回复判定方式
2014-06-20 修复多图文回复的Bug
2014-07-10 增加第三方接口处理样式
2014-08-02 增加Emoji表格的回复处理
2014-10-01 增加自定义菜单扫一扫、发图片、发地理位置等接口的处理
2014-10-25 增加消息体签名及加解密的支持
2014-11-07 增加该公众号暂时无法提供服务请稍后再试的兼容
2014-12-20 移除高级群发消息通知事件，必要性不大
2015-02-23 移除消息体签名及加解密的支持，必要性不大
2015-04-07 优化客服模式和自动回复模式的判定
2015-05-16 优化日志记录，兼容SAE和自有主机

    米欧光影工作室 http://www.fangbei.org/
    CopyRight 2015 All Rights Reserved
*/

include ('MyDebug.class.php');
include ('WeChat.class.php');
MyDebug::f($_GET,'get.txt');
MyDebug::f($_POST,'post.txt');


define("TOKEN", "201412161997");

$wechatObj = new WeChat();
if (!isset($_GET['echostr'])) {
    $wechatObj->responseMsg();
}else{
    $wechatObj->valid();
}
?>
